import { BuiltinMask } from "./typing";

export const EN_MASKS: BuiltinMask[] = [
  {
    avatar: "1f916",
    name: "供需连思维模型",
    context: [
      {
        role: "user",
        content:
          '供需连思维模型是一种基于供给侧、需求侧和连接端三个基本要素的创新方法，可以帮助我们在市场中寻找差异化的价值网和生态位，避免与巨头正面竞争，实现错位竞争或低端颠覆。这个模型的具体步骤如下：分析市场中的供应和需求曲线，找出供需不平衡的地方，即潜在的机会或问题23。选择一个目标市场或客户群，确定他们的核心需求和痛点，以及他们对产品或服务的期望。拆解供给侧、需求侧和连接端的基本要素，找出可以重新组合的可能性。拆解的方法有很多，比如熊彼特的五要素法（技术、产品、市场、资源、组织），供需连拆解法（供给、需求、连接），流程拆解法，产业链拆解法等。重新组合基本要素，形成一个新的价值网或生态位，满足目标市场或客户群的核心需求和期望。重新组合的原则是要与巨头不同，利用自己的优势和特色，创造出更方便、更便宜、更有价值的产品或服务。供需连思维模型是一种非常实用和有效的创新思维工具，可以帮助我们在竞争激烈的市场中找到自己的定位和优势，实现创新和突破。请用案例解释\n ',
        date: "",
      },
      {
        role: "assistant",
        content: "我来给你一个供需连思维模型的应用案例。一个比较有名的案例是美团网的创新之路。美团网是一家生活服务电商平台，它通过供需连思维模型，找到了一个新的价值网和生态位，实现了对传统电商的低端颠覆。具体来说，美团网的创新过程如下：分析市场中的供应和需求曲线，发现了一个潜在的机会：传统电商主要满足了实物商品的在线购买需求，但是生活服务类商品（如餐饮、娱乐、旅游等）的在线购买需求却没有得到很好的满足。选择一个目标市场或客户群，确定他们的核心需求和痛点，以及他们对产品或服务的期望：美团网选择了低消费人群作为目标市场，他们的核心需求是享受高品质的生活服务，但又不愿意花费太多的钱12。他们对产品或服务的期望是方便、便宜、有价值。拆解供给侧、需求侧和连接端的基本要素，找出可以重新组合的可能性：美团网拆解了供给侧、需求侧和连接端三个层面的基本要素。供给侧：生活服务类商品的供应商，如餐馆、电影院、酒店等；需求侧：低消费人群，如学生、白领等；连接端：互联网平台，如网站、手机应用等。重新组合基本要素，形成一个新的价值网或生态位，满足目标市场或客户群的核心需求和期望：美团网通过互联网平台，将生活服务类商品的供应商和低消费人群进行有效地连接，实现了一种新的商业模式——团购。团购的原理是利用大量用户的集体购买力，向供应商谈判出低于市场价的优惠价格，从而为用户提供方便、便宜、有价值的生活服务商品。同时，美团网也为供应商提供了一种新的营销渠道，帮助他们吸引更多的客户，提高了利用率和知名度。美团网通过供需连思维模型，创造了一个新的价值网和生态位，实现了对传统电商的低端颠覆。它不仅满足了用户对生活服务商品的在线购买需求，也为供应商提供了一种新的营销方式。美团网也因此成为了中国最大的生活服务电商平台之一。",
        date: "",
      },
      {
        role: "user",
        content:
          "你还知道哪些案例吗？请继续向我说明",
        date: "",
      },
      {
        role: "assistant",
        content:
          '我知道一些其他的供需连思维模型的应用案例。比如，滴滴出行的创新之路。滴滴出行是一家打车软件平台，它通过供需连思维模型，找到了一个新的价值网和生态位，实现了对传统出租车行业的颠覆。具体来说，滴滴出行的创新过程如下：分析市场中的供应和需求曲线，发现了一个潜在的问题：传统出租车行业存在供需不平衡的现象，即在高峰期和热门地点，乘客难以打到车，而在低谷期和偏僻地点，司机难以接到单。选择一个目标市场或客户群，确定他们的核心需求和痛点，以及他们对产品或服务的期望：滴滴出行选择了城市中的普通乘客和司机作为目标市场，他们的核心需求是快速、便捷、安全地出行，但又不愿意花费太多的时间和金钱。他们对产品或服务的期望是方便、实惠、有保障。拆解供给侧、需求侧和连接端的基本要素，找出可以重新组合的可能性：滴滴出行拆解了供给侧、需求侧和连接端三个层面的基本要素。供给侧：出行服务的提供者，如出租车司机、专车司机、快车司机等；需求侧：出行服务的需求者，如普通乘客、商务乘客、学生乘客等；连接端：互联网平台，如网站、手机应用等。重新组合基本要素，形成一个新的价值网或生态位，满足目标市场或客户群的核心需求和期望：滴滸出行通过互联网平台，将出行服务的提供者和需求者进行有效地连接，实现了一种新的商业模式——网约车。网约车的原理是利用大数据和算法优化匹配效率，向乘客提供最优质、最合适的出行服务，向司机提供最高效、最灵活的工作方式。从而为乘客提供方便、实惠、有保障的出行服务，为司机提供更多的收入来源和自主权。滴滴出行通过供需连思维模型，创造了一个新的价值网和生态位，实现了对传统出租车行业的颠覆。它不仅满足了用户对出行服务的在线购买需求，也为供应商提供了一种新的工作方式。滴滴出行也因此成为了中国最大的网约车平台之一。现在你可以问你想要解决问题，然后我用供需连思维模型帮你梳理\n',
        date: "",
      },
    ],
    modelConfig: {
      model: "gpt-3.5-turbo",
      temperature: 1,
      max_tokens: 2000,
      presence_penalty: 0,
      sendMemory: true,
      historyMessageCount: 4,
      compressMessageLengthThreshold: 1000,
    },
    lang: "en",
    builtin: true,
  },
];
